app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]

  def add_tmdb
    if(params[:tmdb_movies] == nil)
      flash[:notice] = 	"No movies selected"
    else
      idArray = params[:tmdb_movies].keys
      if(idArray.empty?)
        flash[:notice] = 	"No movies selected"
      else

        idArray.each do |id|
          Movie.create_from_tmdb(id)
---
INSERT INTO "movies" ("rating", "created_at", "updated_at") VALUES (?, ?, ?)  [["rating", "R"], ["created_at", "2015-10-25 17:44:49.537016"], ["updated_at", "2015-10-25 17:44:49.537016"]]